files/sns/app/controllers/feeds_controller.rb

  def create
    case params[:feed_type]
      when 'text'
        feed = @current_user.feed.create feed_type: 'text', comment: params[:comment]
        render json: {errors: feed.errors.full_messages}, status: :bad_request and return if feed.errors.any?
      when 'image'
        begin
          img = Magick::Image.from_blob(File.read params[:image].tempfile).shift
          exif = "#{img.properties['exif:Make']||=''} #{img.properties['exif:Model']||=''}"
          img.format = "JPEG"
          img.resize_to_fit!(500, 500)
          feed = @current_user.feed.create feed_type: 'image', exif: exif, image_file_name: 'default.png'
          image_file_name = "#{feed.id}.jpg"
          img.write "#{Rails.root}/public/images/#{image_file_name}"
          feed.update image_file_name: image_file_name
---
INSERT INTO `feeds` (`feed_type`, `user_id`, `image_file_name`, `exif`, `created_at`, `updated_at`) VALUES ('image', 1, 'default.png', 'Sony SO-04H', '2017-12-12 21:50:22', '2017-12-12 21:50:22')
UPDATE `feeds` SET `image_file_name` = '4.jpg' WHERE `feeds`.`id` = 4

  def index
    feeds = Feed.joins(:user).where("user_id IN (#{scope_user_ids.join(', ')})").select('feeds.*,users.name').order('id DESC').limit(30)
    render json: {count: feeds.count, feeds: feeds} and return
---
SELECT feeds.*,users.name FROM `feeds` INNER JOIN `users` ON `users`.`id` = `feeds`.`user_id` WHERE (user_id IN (3, 4) and feeds.id > 21) ORDER BY id DESC
SELECT COUNT(count_column) FROM (SELECT  feeds.*,users.name AS count_column FROM `feeds` INNER JOIN `users` ON `users`.`id` = `feeds`.`user_id` WHERE (user_id IN (1)) ORDER BY id DESC LIMIT 30) subquery_for_count

  def find_new
    feeds = Feed.joins(:user).where("user_id IN (#{scope_user_ids.join(', ')}) and feeds.id > ?", params[:id].to_i).select('feeds.*,users.name').order('id DESC')
    render json: {count: feeds.length, feeds: feeds} and return if params[:include_items] == '1'
---
SELECT feeds.*,users.name FROM `feeds` INNER JOIN `users` ON `users`.`id` = `feeds`.`user_id` WHERE (user_id IN (1) and feeds.id > 0) ORDER BY id DESC
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def find_old
    feeds = Feed.joins(:user).where("user_id IN (#{scope_user_ids.join(', ')}) and feeds.id < ?", params[:id].to_i).select('feeds.*,users.name').order('id DESC').limit(30)
---
SELECT  feeds.*,users.name FROM `feeds` INNER JOIN `users` ON `users`.`id` = `feeds`.`user_id` WHERE (user_id IN (1) and feeds.id < 1) ORDER BY id DESC LIMIT 30