files/sns/app/controllers/friends_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`login_id` = 'harupu' LIMIT 1
INSERT INTO `friends` (`from_user_id`, `to_user_id`, `created_at`, `updated_at`) VALUES (1, 2, '2017-12-12 21:51:14', '2017-12-12 21:51:14')
---
  def create
    user = User.find_by login_id: params[:login_id]
    render json: {errors: ['指定されたユーザは存在しません']}, status: :bad_request and return if user.nil?
    friend = @current_user.friends_from.create to_user_id: user[:id]