files/sns/app/controllers/sessions_controller.rb

  def create
    begin
      user = User.find_by "login_id='#{params[:login_id]}' and pass='#{ Digest::SHA256.hexdigest params[:pass] }'"
---
SELECT  `users`.* FROM `users` WHERE (login_id='nishimunea' and pass='059a00192592d5444bc0caad7203f98b506332e2cf7abb35d684ea9bf7c18f08') LIMIT 1